return {
    "nvimdev/dashboard-nvim",
    lazy = false,
    opts = function()
        local logo = [[
██╗     ██████╗ █████╗ ███╗   ██╗████████╗    ███████╗███████╗ ██████╗ █████╗ ██████╗ ███████╗    ██╗   ██╗██╗███╗   ███╗
██║    ██╔════╝██╔══██╗████╗  ██║╚══██╔══╝    ██╔════╝██╔════╝██╔════╝██╔══██╗██╔══██╗██╔════╝    ██║   ██║██║████╗ ████║
██║    ██║     ███████║██╔██╗ ██║   ██║       █████╗  ███████╗██║     ███████║██████╔╝█████╗      ██║   ██║██║██╔████╔██║
██║    ██║     ██╔══██║██║╚██╗██║   ██║       ██╔══╝  ╚════██║██║     ██╔══██║██╔═══╝ ██╔══╝      ╚██╗ ██╔╝██║██║╚██╔╝██║
██║    ╚██████╗██║  ██║██║ ╚████║   ██║       ███████╗███████║╚██████╗██║  ██║██║     ███████╗     ╚████╔╝ ██║██║ ╚═╝ ██║
╚═╝     ╚═════╝╚═╝  ╚═╝╚═╝  ╚═══╝   ╚═╝       ╚══════╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝     ╚══════╝      ╚═══╝  ╚═╝╚═╝     ╚═╝
    ]]

        logo = string.rep("\n", 8) .. logo .. "\n\n"

        local opts = {
            theme = "doom",
            hide = {
                statusline = false,
            },
            config = {
                header = vim.split(logo, "\n"),
                center = {
                    { action = "Telescope find_files", desc = " Find File", icon = " ", key = "f" },
                    { action = "ene | startinsert", desc = " New File", icon = " ", key = "n" },
                    { action = "Telescope oldfiles", desc = " Recent Files", icon = " ", key = "r" },
                    { action = "Telescope live_grep", desc = " Find Text", icon = " ", key = "g" },
                    {
                        action = function()
                            require("telescope.builtin").find_files({ cwd = vim.fn.stdpath("config") })
                        end,
                        desc = " Config",
                        icon = " ",
                        key = "c",
                    },
                    { action = "Lazy", desc = " Lazy", icon = "󰒲 ", key = "l" },
                    { action = "qa", desc = " Quit", icon = " ", key = "q" },
                },
                footer = "better than VS Code",
            },
        }

        for _, button in ipairs(opts.config.center) do
            button.desc = button.desc .. string.rep(" ", 43 - #button.desc)
            button.key_format = "  %s"
        end

        -- open dashboard after closing lazy
        if vim.o.filetype == "lazy" then
            vim.api.nvim_create_autocmd("WinClosed", {
                pattern = tostring(vim.api.nvim_get_current_win()),
                once = true,
                callback = function()
                    vim.schedule(function()
                        vim.api.nvim_exec_autocmds("UIEnter", { group = "dashboard" })
                    end)
                end,
            })
        end

        return opts
    end,
}
